<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"ec8625c4d90e2365026aa3bb044df49b0afd70c2958b4f6692844d1be81bdbd9","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #978 at https://github.com/cal-itp/data-infra/actions/runs/19378107522","plan_out_hash":"8293312126347735a72f3d1519dcf1f3671d4cc9f54f719e2d29ea0f54584a12","plan_hash":"cc3edd148d6a40467dd5e9dfeed31ea06f183d7ffa8ab5e27768a7376e622079","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 1 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer["dags/dbt_all_dag.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "aYowCA==" -> (known after apply)
!~      detect_md5hash      = "BX7Ct0bTK/vEco14Z3GdDA==" -> "different hash"
!~      generation          = 1759448629429752 -> (known after apply)
        id                  = "calitp-composer-dags/dbt_all_dag.py"
!~      md5hash             = "BX7Ct0bTK/vEco14Z3GdDA==" -> (known after apply)
        name                = "dags/dbt_all_dag.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/dbt_daily_dag.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "suRrVA==" -> (known after apply)
!~      detect_md5hash      = "9jrrr0T6SwiHUqRKeX3HKQ==" -> "different hash"
!~      generation          = 1762466527713296 -> (known after apply)
        id                  = "calitp-composer-dags/dbt_daily_dag.py"
!~      md5hash             = "9jrrr0T6SwiHUqRKeX3HKQ==" -> (known after apply)
        name                = "dags/dbt_daily_dag.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/dbt_manual_dag.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "kzeIUA==" -> (known after apply)
!~      detect_md5hash      = "fJvbbQ/zWg6Ljv/3qyFwdQ==" -> "different hash"
!~      generation          = 1755731202875976 -> (known after apply)
        id                  = "calitp-composer-dags/dbt_manual_dag.py"
!~      md5hash             = "fJvbbQ/zWg6Ljv/3qyFwdQ==" -> (known after apply)
        name                = "dags/dbt_manual_dag.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["plugins/src/dag_utils.py"] will be created
+   resource "google_storage_bucket_object" "calitp-composer" {
+       bucket         = "calitp-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "plugins/src/dag_utils.py"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/plugins/src/dag_utils.py"
+       storage_class  = (known after apply)
    }

Plan: 1 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #978](https://github.com/cal-itp/data-infra/actions/runs/19378107522)